
&НаСервере
Процедура ПриОткрытииНаСервере()
	РегламентГандива.ОбновитьТокенГандива();
	Коменты = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(Объект.Номер),Символы.НПП,"")+"/Comments","GET",, Истина);
	КоментыСрук = РегламентГандива.ПолучитьСтруктуруИзСоответствия(Коменты);
	Если КоментыСрук.Количество() > 0 Тогда
		Объект.Комментарии.Очистить();
		Для каждого стр из КоментыСрук Цикл
			нСтр = Объект.Комментарии.Добавить();
			нСтр.Отправитель = РегламентГандива.СоздатьИлиНайтиПользователя(стр.Author);
			нСтр.Комментарий = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(стр.Text,"<p>",""),"<br />",Символы.ПС),"</p>",Символы.ПС),"&nbsp"," ");
			нСтр.ID = стр.Id;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Объект.ОформлениеТекста = ПолучитьФорматТекст(); 
	ОформлениеТекстаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьФорматТекст()
	
	Возврат Перечисления.узОформлениеТекста.ФорматированныйТекст;
	
КонецФункции


&НаКлиенте
Процедура ЗапросКоментария(Команда)
 
    Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
      ЭтотОбъект);	
 
    ПоказатьВводЗначения(
        Оповещение,
        , // пропускаем начальное значение
        "Напишите комментарий",
        "Строка"
    );
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда
			ОтправитьКомментарийНаСервере(Результат);
			ПриОткрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ОтправитьКомментарийНаСервере(Комент)
	
	ТелоЗапроса = "{""parentCommentId"":0,""text"":"""+Строка(Комент)+""",""addressees"":[0]}";
		
		Результат = РегламентГандива.ОтправитьЗапросГандива(
		"/Requests/7421/Comments",
		"POST",
		ТелоЗапроса,
		Истина
		,Истина);
	
КонецФункции
