
&НаКлиенте
Процедура Расш1_ЗапроситьЗадачуПосле(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
	ЭтотОбъект);	
	
	ПоказатьВводЗначения(
	Оповещение,
	, // пропускаем начальное значение
	"Введи ID задачи",
	"Строка"
	);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда
		ЗапроситьЗадачуНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗапроситьЗадачуНаСервере(ИдЗадачи)
	
	ДанныеЗ = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(ИдЗадачи),Символы.НПП,"")+"?isFast=true","GET",, Истина);
	
	
КонецПроцедуры
