Функция ОтправитьЗапросГандива(Адрес, Метод, Тело = Неопределено, Авторизация = Ложь, ИспользоватьJSON = Ложь) Экспорт
	
	Заголовки = Новый Соответствие;
	Если Авторизация Тогда
		Заголовки.Вставить("Authorization", "Bearer " + Строка(Константы.ТокенГандива.Получить()));
	КонецЕсли;
	Если ИспользоватьJSON Тогда
		// Для JSON API
		Заголовки.Вставить("Content-Type", "application/json");
		Заголовки.Вставить("Accept", "application/json");
	Иначе
		// Для обычных запросов
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Заголовки.Вставить("Accept", "application/json");
	КонецЕсли;	
	Соединение = Новый HTTPСоединение("192.168.6.48",443,,,,5,Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	Если Не Тело = Неопределено Тогда 
		Запрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Ответ = Соединение.ВызватьHTTPМетод(Метод,Запрос);  
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Значение = ПрочитатьJSON(ЧтениеJSON,Истина);          
	ЧтениеJSON.Закрыть();	
	
	Возврат Значение;
	
КонецФункции

Функция ОтправитьЗапросГандиваАвторизация(Адрес, Метод, Тело = Неопределено, Авторизация = Ложь, ИспользоватьJSON = Ложь, ДанныеАвторизации = Неопределено) Экспорт
	
	Заголовки = Новый Соответствие;
	Если Авторизация Тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТокеныГандива.Токен КАК Токен
		|ИЗ
		|	РегистрСведений.ТокеныГандива КАК ТокеныГандива
		|ГДЕ
		|	ТокеныГандива.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ДанныеАвторизации.Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Токен = ВыборкаДетальныеЗаписи.токен;
	КонецЦикла;
	
		Заголовки.Вставить("Authorization", "Bearer " + Токен);
	КонецЕсли;
	Если ИспользоватьJSON Тогда
		// Для JSON API
		Заголовки.Вставить("Content-Type", "application/json");
		Заголовки.Вставить("Accept", "application/json");
	Иначе
		// Для обычных запросов
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Заголовки.Вставить("Accept", "application/json");
	КонецЕсли;	
	Соединение = Новый HTTPСоединение("192.168.6.48",443,,,,5,Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	Если Не Тело = Неопределено Тогда 
		Запрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Ответ = Соединение.ВызватьHTTPМетод(Метод,Запрос);  
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Значение = ПрочитатьJSON(ЧтениеJSON,Истина);          
	ЧтениеJSON.Закрыть();	
	
	Возврат Значение;
	
КонецФункции

Процедура ОбновитьТокенГандива() Экспорт
	
	
	//Для i=1 По 60 Цикл
	
	Тело = "grant_type=password&username=a.sinicyn%40tonusnn.ru&password=TolyDizel536707%2B&nativeOnly=true";
	Значение = ОтправитьЗапросГандива("/Token","POST", Тело);           
	Токен = Значение.Получить("access_token");	
	Константы.ТокенГандива.Установить(Токен);
	
	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЗаявкиГандива() Экспорт
	
	ОбновитьТокенГандива();
	КоличествоЗапросов = ПолучитьКоличествоЗапросов(); 
	Если КоличествоЗапросов > 0 Тогда
		ПолучитьИЗагрузитьЗаявкиИзГандивы(КоличествоЗапросов);	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКоличествоЗапросов()
	
	Тело = "type=forgroup&page=1&size=100&descending=true&status=0&doNotSearchInArchive=&sort=Id";
	Значение = ОтправитьЗапросГандива("/Requests","GET", Тело, Истина);           
	КоличествоЗаявок = Значение.Получить("Total");
	Если КоличествоЗаявок = Цел(КоличествоЗаявок / 100) Тогда
		Возврат КоличествоЗаявок;
	Иначе
		Возврат Цел(КоличествоЗаявок / 100) + 1;
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьИЗагрузитьЗаявкиИзГандивы(КоличествоЗапросов)
	
	Для i=1 По КоличествоЗапросов Цикл
		
		Тело = "type=forgroup&page="+i+"&size=100&descending=true&status=0&doNotSearchInArchive=&sort=Id";
		Заявки = ОтправитьЗапросГандива("/Requests","GET", Тело, Истина);
		МассивСтруктурЗаявок = ПолучитьСтруктуруИзСоответствия(Заявки.Получить("Requests"));
		СоздатьИлиИзменитьЗаявкиГандива(МассивСтруктурЗаявок);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СоздатьИлиИзменитьЗаявкиГандива(МассивЗаявок)
	
	Константы.ДатаПоследнейЗагрузкиДоп.Установить(ТекущаяДата());
	
	Для каждого стр из МассивЗаявок Цикл
		
		ДатаПроверка = ПреобразоватьДату(стр.LastModifiedDate);
		Если ДатаПроверка > Константы.ДатаПоследнейЗагрузки.Получить() Тогда
			
			Документ = НайтиИлиСоздатьДокументЗаявка(стр.Id);
			//Документ = Справочники.узЗадачи.СоздатьЭлемент();
			Документ.Код = стр.Id;
			Попытка
				Наим = ПолучитьНаименованиеГандива(стр.Description);
				Документ.Наименование = Наим;
			Исключение 
				Документ.Наименование = стр.Description;
			КонецПопытки;
			Документ.ДатаСоздания = ПреобразоватьДату(стр.CreateDate);
			Документ.Статус = ПолучитьСтатусЗаявкиГандива(стр.Status);
			Документ.ТекстСодержания = стр.Description;
			Документ.ГОтдел = НайтиИлиСоздатьСправочнуюИнформацию("ОтделГандива",стр.Department);
			Документ.ГКатегория = НайтиИлиСоздатьСправочнуюИнформацию("КатегорияГандива",стр.Category);
			Документ.ГТип = НайтиИлиСоздатьСправочнуюИнформацию("ТипГандива",стр.RequestType);
			Документ.ГВид = НайтиИлиСоздатьСправочнуюИнформацию("ВидГандива",стр.JobType);
			Документ.ПоказыватьВОтчетахИКанбанДоске = Истина;
			Документ.НомерВнешнейЗаявки = стр.Id;
			Документ.ГруппаОтветственности = ПолучитьГруппуОтветственности(стр.ResponsibilityGroup);
			Документ.Проект = Справочники.узПроекты.НайтиПоНаименованию("Основной");
			Документ.URLВнешнейЗаявки = "https://gandiva.tonusnn.ru/Request/Edit/" + СтрЗаменить(стр.Id,Символы.НПП,"");
			Попытка
				Документ.ВнутреннийТелефон = стр.CustomFields[0].Value;
				Документ.НомерКомпьютера = стр.CustomFields[1].Value;
			Исключение
			КонецПопытки;
			Попытка
				Документ.Автор = СоздатьИлиНайтиПользователя(стр.Initiator);
				Документ.Исполнитель = СоздатьИлиНайтиПользователя(стр.Contractor);
				Документ.НаблюдателиЗаОсновнойЗадачей.Очистить();
				Для каждого стр2 из стр.Observers Цикл
					нСтр = Документ.НаблюдателиЗаОсновнойЗадачей.Добавить();
					нСтр.Пользователь = СоздатьИлиНайтиПользователя(стр2);
				КонецЦикла;
			Исключение
			КонецПопытки;
			
			
			ДанныеДоп = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(стр.Id),Символы.НПП,"")+"?isFast=true","GET",, Истина);
			
			Соглас = ДанныеДоп.Получить("Approvers");
			Если ЗначениеЗаполнено(Соглас) Тогда
				
				Документ.Согласующие.Очистить();
				Для каждого стр из Соглас Цикл
					нстр = Документ.Согласующие.Добавить();
					нстр.ФИО = Справочники.Пользователи.НайтиПоРеквизиту("ИдПользователяГандива",стр.Получить("Id"));
					Если стр.Получить("Status") = 3 тогда
						нстр.Согласовал = Истина;
					Иначе
						нстр.Согласовал = Ложь;
					конецЕсли;
					нстр.Дата = ПреобразоватьДату(стр.Получить("ResolutionDate"));
					
				КонецЦикла;
				
				
			КонецЕсли;
			
			Хэштеги = ДанныеДоп.Получить("HashTags");
			Документ.ДопРеквизитыМножественные.Очистить();
			Для каждого стр из Хэштеги цикл
				СтрокаДопРеквизитыМножественные = Документ.ДопРеквизитыМножественные.Добавить();	
				СтрокаДопРеквизитыМножественные.Свойство = ПланыВидовХарактеристик.узДопРеквизитыЗадачМножественные.НайтиПоКоду("000000001");
				СтрокаДопРеквизитыМножественные.КлючСтроки = "" + Новый УникальныйИдентификатор;
				СтрокаДопРеквизитыМножественные.Значение = Справочники.узМеткиЗадач.НайтиПоНаименованию(стр);		
			КонецЦикла;
			
			
			Документ.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Константы.ДатаПоследнейЗагрузки.Установить(Константы.ДатаПоследнейЗагрузкиДоп.Получить());
	
КонецПроцедуры

функция ПолучитьГруппуОтветственности(д)
	
	Груп = Справочники.ГруппыОтветственности.НайтиПоКоду(д.Id);
	Если ЗначениеЗаполнено(Груп) Тогда
		
		Возврат Груп;
	Иначе
		ГрупО = Справочники.ГруппыОтветственности.СоздатьЭлемент();
		
	КонецЕсли;
	ГрупО.Код = д.Id;
	ГрупО.Наименование = д.Name;
	ГрупО.Записать();
	Возврат ГрупО.Ссылка;
	
	
конецФункции


функция ПолучитьНаименованиеГандива(текст) Экспорт
	Заголовки = Новый Соответствие;
	Тело = "text="+текст;
	
	// Для обычных запросов
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Accept", "application/json");
	
	Соединение = Новый HTTPСоединение("doctor-1c.ru",443,,,,5,Истина);
	
	Запрос = Новый HTTPЗапрос("/webhook/da6419ee-e4bb-41db-a456-20ffed42a9c0", Заголовки);
	Если Не Тело = Неопределено Тогда 
		Запрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Ответ = Соединение.ВызватьHTTPМетод("GET",Запрос);  
	СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Значение = ПрочитатьJSON(ЧтениеJSON,Истина);          
	ЧтениеJSON.Закрыть();
	
	
	ОтветСтрока = ПолучитьСтруктуруИзСоответствия(Значение.Получить("myField"));	
	
	Возврат ОтветСтрока;
	
КонецФункции


функция ПолучитьСтатусЗаявкиГандива(Статус)
	
	//Если Статус = 0 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.Отсутствует;
	//ИначеЕсли Статус = 1 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.Новый;
	//ИначеЕсли Статус = 2 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.НаРассмотрении;
	//ИначеЕсли Статус = 3 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.НаСогласовании;
	//ИначеЕсли Статус = 4 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.НаУточнении;
	//ИначеЕсли Статус = 5 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.Отклонена;
	//ИначеЕсли Статус = 6 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.ВРаботе;
	//ИначеЕсли Статус = 7 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.Отменено;
	//ИначеЕсли Статус = 8 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.ПроверкаВыполнения;
	//ИначеЕсли Статус = 9 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.Закрыта;
	//ИначеЕсли Статус = 10 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.Ожидает;
	//ИначеЕсли Статус = 11 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.ОжидаетПредшественника;
	//ИначеЕсли Статус = 12 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.ОжидаетПубликацииПлана;
	//ИначеЕсли Статус = 13 Тогда
	//	Возврат Перечисления.СтатусыЗадачГандива.НаУточненииУИсполнителя;
	//КонецЕсли;
	
	Возврат Справочники.узСтатусыЗадачи.НайтиПоРеквизиту("ИДГандива", Статус);
	
	
КонецФункции

Функция СоздатьИлиНайтиПользователя(Данные) Экспорт
	Если Данные = Неопределено Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	Иначе
		
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдПользователяГандива", Данные.Id);
		Если ЗначениеЗаполнено(Пользователь) Тогда
			Возврат Пользователь;
		Иначе
			Пользователь = Справочники.Пользователи.СоздатьЭлемент();
			Пользователь.ИдПользователяГандива = Данные.Id;
			Пользователь.Почта = Данные.Login;
			Пользователь.Фамилия = Данные.LastName;
			Пользователь.Имя = Данные.FirstName;
			Пользователь.Отчество = Данные.MiddleName;
			Пользователь.Проффесия = Данные.Appoint;
			Пользователь.Наименование = Данные.LastName + " " + Лев(Данные.FirstName,1) +"."+Лев(Данные.MiddleName,1);
			//Пользователь.ПользовательИБИмя = Пользователь.Наименование;
			Пользователь.Записать();
			Возврат Пользователь.Ссылка;
			
		КонецЕсли;	 
	КонецЕсли;	
КонецФункции


Функция НайтиИлиСоздатьСправочнуюИнформацию(Справочник, Данные)
	
	Если Справочник = "ОтделГандива" Тогда
		Отдел = Справочники.ОтделГандива.НайтиПоКоду(Данные.Id);
		Если ЗначениеЗаполнено(Отдел) Тогда
			Возврат Отдел;
		Иначе
			Возврат СоздатьОтделГандива(Данные);
		КонецЕсли;
	Иначе
		НСИ = Справочники[Справочник].НайтиПоКоду(Данные.id);
		Если ЗначениеЗаполнено(НСИ) Тогда
			Возврат НСИ;
		Иначе
			Возврат СоздатьНСИГандива(Справочник, Данные);
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции

Функция СоздатьНСИГандива(Справочник, Данные)
	
	НСИ = Справочники[Справочник].СоздатьЭлемент();
	НСИ.Код = Данные.Id;
	Если Справочник = "КатегорияГандива" Тогда
		НСИ.Владелец = Справочники.ОтделГандива.НайтиПоКоду(Данные.DepartmentId);
	ИначеЕсли Справочник = "ТипГандива" Тогда
		НСИ.Владелец = Справочники.КатегорияГандива.НайтиПоКоду(Данные.CategoryId);
	ИначеЕсли Справочник = "ВидГандива" Тогда
		НСИ.Владелец = Справочники.ТипГандива.НайтиПоКоду(Данные.RequestTypeId);
	КонецЕсли;
	НСИ.Наименование = Данные.Name;
	НСИ.Записать();
	Возврат НСИ.Ссылка;
	
КонецФункции


Функция СоздатьОтделГандива(Данные)
	
	Отдел = Справочники.ОтделГандива.СоздатьЭлемент();
	Отдел.Код = Данные.Id;
	Отдел.Наименование = Данные.Name;
	Отдел.Записать();
	Возврат Отдел.Ссылка;
	
КонецФункции


Функция НайтиИлиСоздатьДокументЗаявка(ид)
	
	Док = Справочники.узЗадачи.НайтиПоКоду(ид);
	Если ЗначениеЗаполнено(Док) Тогда
		Возврат док.ПолучитьОбъект();
	Иначе
		Возврат Справочники.узЗадачи.СоздатьЭлемент();
	КонецЕсли;
	
КонецФункции


Функция ПреобразоватьДату(Дата)
	Попытка
	ДатаВремя = Дата;
	Дата1С = Дата(Сред(ДатаВремя, 1, 4), 
	Сред(ДатаВремя, 6, 2), 
	Сред(ДатаВремя, 9, 2), 
	Сред(ДатаВремя, 12, 2), 
	Сред(ДатаВремя, 15, 2), 
	Сред(ДатаВремя, 18, 2));
	
	Возврат Дата1С;
Исключение
	Возврат Дата("01.01.0001 00:00:00");
	КонецПопытки;
КонецФункции


Функция ПолучитьСтруктуруИзСоответствия(ЗначВход) Экспорт
	
	СтруктураВозврат=Новый Структура;
	
	Если ТипЗнч(ЗначВход)=Тип("Соответствие") Тогда
		
		ФлагОщибка=Ложь;
		
		Для Каждого р Из ЗначВход Цикл
			Попытка
				СтруктураВозврат.Вставить(р.Ключ,ПолучитьСтруктуруИзСоответствия(р.Значение));
			Исключение
				ФлагОщибка=Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
		
		Если ФлагОщибка Тогда // пришел ключь который не возможно поместить в структуру
			СтруктураВозврат = Новый Массив;
			Для Каждого р Из ЗначВход Цикл
				ДопСтруктура=Новый Структура;
				ДопСтруктура.Вставить("Ключ",р.Ключ);
				ДопСтруктура.Вставить("Значение",ПолучитьСтруктуруИзСоответствия(р.Значение));
				СтруктураВозврат.Добавить(ДопСтруктура);
			КонецЦикла;
		КонецЕсли;
		
		Возврат СтруктураВозврат; 
		
	ИначеЕсли ТипЗнч(ЗначВход)=Тип("Массив") Тогда
		
		НовыйМассив=Новый Массив;
		Для Каждого ЭлМ Из ЗначВход Цикл
			НовыйМассив.Добавить(ПолучитьСтруктуруИзСоответствия(ЭлМ));
		КонецЦикла;
		Возврат НовыйМассив;
		
	КонецЕсли;
	
	Возврат ЗначВход; 
	
КонецФункции

Процедура ОбновитьТокеныГандивыВсехПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТокеныГандива.Пользователь КАК Пользователь,
	|	ТокеныГандива.Токен КАК Токен
	|ИЗ
	|	РегистрСведений.ТокеныГандива КАК ТокеныГандива";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка	
			Если ЗначениеЗаполнено(Выборка.Пользователь.ГПочта) и ЗначениеЗаполнено(Выборка.Пользователь.ГПароль) Тогда
				Логин = КодироватьСтроку(Выборка.Пользователь.ГПочта,СпособКодированияСтроки.КодировкаURL );
				Пароль = КодироватьСтроку(Выборка.Пользователь.ГПароль,СпособКодированияСтроки.КодировкаURL );
				
				Тело = "grant_type=password&username="+Логин+"&password="+Пароль+"&nativeOnly=true";
				Значение = ОтправитьЗапросГандива("/Token","POST", Тело);           
				Токен = Значение.Получить("access_token");	
				
				МЗ = РегистрыСведений.ТокеныГандива.СоздатьМенеджерЗаписи();
				МЗ.Пользователь = Выборка.Пользователь;
				МЗ.Токен = Токен;
				МЗ.Записать(Истина);
				
				
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	
	
КонецПроцедуры
