
&После("ПриОткрытии")
&НаКлиенте
Процедура Расш1_ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Объект.ОформлениеТекста = ПолучитьОформлениеТекста();
	Если Объект.ОформлениеТекста = ПредопределенноеЗначение("Перечисление.узОформлениеТекста.Markdown") Тогда
		Если ЗначениеЗаполнено(Объект.ТекстСодержания) Тогда
			Элементы.ГруппаСтраницыОформлениеСодержания.ТекущаяСтраница = Элементы.ГруппаСтраницаПросмотр;
		Иначе
			Элементы.ГруппаСтраницыОформлениеСодержания.ТекущаяСтраница = Элементы.ГруппаСтраницаТекст;
		Конецесли;
	Конецесли;
	ОформлениеТекстаПриИзмененииНаСервере();
	ВыполнитьДействиеДляСтраницы();
КонецПроцедуры

&наСервере
функция ПолучитьОформлениеТекста()
	Возврат Перечисления.узОформлениеТекста.Markdown;
КонецФункции


&НаСервере
Процедура ПриОткрытииНаСервере()
	РегламентГандива.ОбновитьТокенГандива();
	Коменты = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(Объект.Код),Символы.НПП,"")+"/Comments","GET",, Истина);
	КоментыСрук = РегламентГандива.ПолучитьСтруктуруИзСоответствия(Коменты);
	Если КоментыСрук.Количество() > 0 Тогда
		Объект.Комментарии.Очистить();
		Для каждого стр из КоментыСрук Цикл
			нСтр = Объект.Комментарии.Добавить();
			нСтр.Автор= РегламентГандива.СоздатьИлиНайтиПользователя(стр.Author);
			нСтр.Комментарий = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(стр.Text,"<p>",""),"<br />",Символы.ПС),"</p>",Символы.ПС),"&nbsp"," ");
			нСтр.ID = стр.Id;
			нстр.КлючСтроки = нстр.ID;
			
		КонецЦикла;
	КонецЕсли;
	
	
	
	
	
	
	
	ДанныеЗ = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(Объект.Код),Символы.НПП,"")+"?isFast=true","GET",, Истина);
	//Объект.ДопРеквизитыМножественные.Очистить();
	Соглас = ДанныеЗ.Получить("Approvers");
	Если ЗначениеЗаполнено(Соглас) Тогда
		
		Объект.Согласующие.Очистить();
		Для каждого стр из Соглас Цикл
			нстр = Объект.Согласующие.Добавить();
			нстр.ФИО = Справочники.Пользователи.НайтиПоРеквизиту("ИдПользователяГандива",стр.Получить("Id"));
			Если стр.Получить("Status") = 3 тогда
				нстр.Согласовал = Истина;
			Иначе
				нстр.Согласовал = Ложь;
			конецЕсли;
			нстр.Дата = ПреобразоватьДату(стр.Получить("ResolutionDate"));
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
	Хэштеги = ДанныеЗ.Получить("HashTags");
	Объект.ДопРеквизитыМножественные.Очистить();
	Для каждого стр из Хэштеги цикл
		СтрокаДопРеквизитыМножественные = Объект.ДопРеквизитыМножественные.Добавить();	
		СтрокаДопРеквизитыМножественные.Свойство = Свойство_МеткаЗадачи;
		СтрокаДопРеквизитыМножественные.КлючСтроки = "" + Новый УникальныйИдентификатор;
		СтрокаДопРеквизитыМножественные.Значение = Справочники.узМеткиЗадач.НайтиПоНаименованию(стр);		
	КонецЦикла;
	ОбновитьВидимостьКомандаМетки();
	ОбновитьОтображениеМетокЗадачи();
	
КонецПроцедуры

Функция ПреобразоватьДату(Дата)
	Попытка	
		ДатаВремя = Дата;
		Дата1С = Дата(Сред(ДатаВремя, 1, 4), 
		Сред(ДатаВремя, 6, 2), 
		Сред(ДатаВремя, 9, 2), 
		Сред(ДатаВремя, 12, 2), 
		Сред(ДатаВремя, 15, 2), 
		Сред(ДатаВремя, 18, 2));
		
		Возврат Дата1С;
	Исключение
		Возврат Дата("00010101");
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура Расш1_НаписатьКоментарийПосле(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
	ЭтотОбъект);	
	
	ПоказатьВводЗначения(
	Оповещение,
	, // пропускаем начальное значение
	"Напишите комментарий",
	"Строка"
	);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда
		ОтправитьКомментарийНаСервере(Результат);
		ПриОткрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ОтправитьКомментарийНаСервере(Комент)
	
	ТелоЗапроса = "{""parentCommentId"":0,""text"":"""+Строка(Комент)+""",""addressees"":[0]}";
	ДанныеАвторизация = Новый Структура;
	ДанныеАвторизация.Вставить("Логин", Пользователи.ТекущийПользователь());
	Результат = РегламентГандива.ОтправитьЗапросГандиваАвторизация(
	"/Requests/"+СтрЗаменить(Строка(Объект.Код),Символы.НПП,"")+"/Comments",
	"POST",
	ТелоЗапроса,
	Истина
	,Истина, ДанныеАвторизация);
	
КонецФункции
