
&НаСервере
Процедура Команда4НаСервере()
	Ответ = РегламентГандива.ПолучитьНаименованиеГандива(Объект.Реквизит);
	МассивСтруктурЗаявок = РегламентГандива.ПолучитьСтруктуруИзСоответствия(Ответ.Получить("myField"));
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	Команда4НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда3НаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	Команда3НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	КомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаНаСервере()
	РегламентГандива.ОбновитьЗаявкиГандива();	
КонецПроцедуры

&НаСервере
Процедура Команда2НаСервере()
// Формируем данные в нужном формате
РегламентГандива.ОбновитьТокенГандива();
ТелоЗапроса = "{""parentCommentId"":0,""text"":""Комментарий из 1С"",""addressees"":[0]}";

Результат = РегламентГандива.ОтправитьЗапросГандива(
    "/Requests/7421/Comments",
    "POST",
    ТелоЗапроса,
    Истина
,Истина);	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
КонецПроцедуры
